/*Напишите приложение, которое сначала примет от пользователя в 5 строковых
переменных 5 значений, а затем выведет их на экран по одному символу на строку. При
вводе по одной букве слова“Hello” вы должны получить результат вывода на экран
значений переменных:
H
e
l
l
o*/

char firstLetter = Convert.ToChar(Console.ReadLine());
char secondLetter = Convert.ToChar(Console.ReadLine());
char thirdLetter = Convert.ToChar(Console.ReadLine());
char quadrupleLetter = Convert.ToChar(Console.ReadLine());
char fifthLetter = Convert.ToChar(Console.ReadLine());
Console.WriteLine(firstLetter);
Console.WriteLine(secondLetter);
Console.WriteLine(thirdLetter);
Console.WriteLine(quadrupleLetter);
Console.WriteLine(fifthLetter);
