/*Имеется 3 переменных типа int x = 10, y = 12, и z = 3;
Выполните, рассчитайте и выведите на экран результат следующих операций для этих
переменных:
x += y - x++ * z;
z = --x - y * 5;
y /= x + 5 % z;
z = x++ + y * 5;
x = y - x++ * z.
Внимательно ознакомьтесь с материалом по последней ссылке в рекомендуемых
ресурсах.*/

int x = 10, y = 12, z = 3;

x = x + y - x++ * z; //10+12-10*3   1.x*z = 30, 2.12-30= -18, 
Console.WriteLine($"x={x} y={y} z={z}"); //x=-8
z = --x - y * 5; //-8-1-12*5
Console.WriteLine($"x={x} y={y} z={z}"); //x=-9 y=12 z=-69
y /= x + 5 % z; //12/-8+5%-69  12/-9 + 5
Console.WriteLine($"x={x} y={y} z={z}"); //x=-9 y=-3 z=-69
z = x++ + y * 5; // z=-24
Console.WriteLine($"x={x} y={y} z={z}"); //x=-8 y=-3 z=-24
x = y - x++ * z; // x = -195
Console.WriteLine($"x={x} y={y} z={z}");



